[
  {
    "title": "Staking on Ethereum",
    "category": "Degen",
    "body": "<h1>How to stake your ETH</h1><p>It all depends on how much you are willing to stake. You'll need 32 ETH to activate your own validator, but it is possible to stake less.</p><p>Check out the options below and go for the one that is best for you, and for the network.</p><h2>Solo home staking</h2><ul><li><em>Most impactful</em></li><li>Full control</li><li>Full rewards</li><li>Trustless</li></ul><p>Solo staking on Ethereum is the <strong>gold standard</strong> for staking. It provides full participation rewards, improves the decentralization of the network, and never requires trusting anyone else with your funds.</p><p>Those considering solo staking should have at least 32 ETH and a dedicated computer connected to the internet ~24/7. Some technical know-how is helpful, but easy-to-use tools now exist to help simplify this process.</p><h2>Staking as a service</h2><ul><li>Your 32 ETH</li><li>Your validator keys</li><li>Entrusted node operation</li></ul><p>If you don't want or don't feel comfortable dealing with hardware but still want to stake your 32 ETH, staking-as-a-service options allow you to delegate the hard part while you earn native block rewards.</p><p>These options usually walk you through creating a set of validator credentials, uploading your signing keys to them, and depositing your 32 ETH. This allows the service to validate on your behalf.</p><p>This method of staking requires a certain level of trust in the provider. To limit counter-party risk, the keys to withdrawal your ETH are usually kept in your possession.</p><h2>Pooled staking</h2><ul><li>Stake any amount</li><li>Earn rewards</li><li>Keep it simple</li><li><em>Popular</em></li></ul><p>Several pooling solutions now exist to assist users who do not have or feel comfortable staking 32 ETH.</p><p>Many of these options include what is known as 'liquid staking' which involves an ERC-20 liquidity token that represents your staked ETH.</p><p>Liquid staking enables easy and anytime exiting and makes staking as simple as a token swap. This option also allows users to hold custody of their assets in their own Ethereum wallet.</p><p>Pooled staking is not native to the Ethereum network. Third parties are building these solutions, and they carry their own risks.</p><h2>Centralized exchanges</h2><ul><li><em>Least impactful</em></li><li>Highest trust assumptions</li></ul><p>Many centralized exchanges provide staking services if you are not yet comfortable holding ETH in your own wallet. They can be a fallback to allow you to earn some yield on your ETH holdings with minimal oversight or effort.</p><p>The trade-off here is that centralized providers consolidate large pools of ETH to run large numbers of validators. This can be dangerous for the network and its users as it creates a large centralized target and point of failure, making the network more vulnerable to attack or bugs.</p><p>If you don't feel comfortable holding your own keys, that's okay. These options are here for you. In the meantime, consider checking out our wallets page, where you can get started learning how to take true ownership over your funds. When you're ready, come back and level up your staking game by trying one of the self-custody pooled staking services offered.</p>",
    "key": ".//clean-your-cloud-data.md"
  },
  {
    "title": "Mining on Ethereum Classic",
    "category": "Degen",
    "body": "<h1>Mining on Ethereum Classic when possible</h1>\n<p>Streaming is nice, streaming is amazing, but have you ever thought about the consequences on the environment?</p>\n<p>To give you an idea on how bad the streaming is, let's take an example. The size of the article text in the English Wikipedia is around <a href=\"https://en.wikipedia.org/wiki/Wikipedia:Size_of_Wikipedia\">20 gigabytes</a> of data in 2020. It means that everytime you watch a season of the Walking Dead in HD (1080p), you have downloaded on your computer/phone the same amount of data as the entire Wikipedia encyclopaedia.</p>\n<p>Same applies to Spotify, Apple Music, Amazon and Youtube. Music is much smaller than a HD video but an average user consumes several songs in a day so at the end of the year, the impact of the climate is not negligeable.</p>\n<p>Both music and video streaming relies on servers as well as internet infrastructures to transport the data to you. All of this has a cost, so instead of streaming in all circumstances, try to listen to the radio, go the cinema.... Who knows, you might end up meeting real people in real life!</p>\n<p>Don't forget to cancel auto play by default, leading to unnecessary streaming like Youtube is doing. In most video streaming platform, you can save this behavior in the preferences. If you can, use Peertube, a decentralized and open-source video platform, much better for the environment compared to Youtube and more ethical.</p>\n<p>If you still want to use YouTube, we recommend <a href=\"https://addons.mozilla.org/en-US/firefox/addon/youtube-focus/?utm_source=addons.mozilla.org&amp;utm_medium=referral&amp;utm_content=search\">Youtube Focus</a>, an add-on who tries to promote a healthier watching. As said on their <a href=\"https://github.com/Jompa14/YouTube_Focus\">Github</a>, YouTube has one billion hours watched daily, and it’s recommendation algorithm generates more than 70% of views. That means 700.000.000 hours every single day. What means that the greatest slice of time that people spend on YouTube isn’t because they searched for something to watch or something to learn, it is because they were suggested by YouTube's algorithm.</p>\n",
    "key": ".//avoid-streaming.md"
  },
  {
    "title": "Investing in tokens",
    "category": "newbie",
    "body": "<h1>How are token prices determined?</h1><p><strong>Token prices are determined by the amount of each token in a pool.</strong></p><p>The smart contract maintains a constant using the following function: x*y=k.</p><p>In this case x = token0, y = token1, k = constant. During each trade a certain amount of one token is removed from the pool for an amount of the other token. To maintain k, the balances held by the smart contract are adjusted during the execution of the trade, therefore changing the price.</p><h1>What is the tokens page?</h1><p>The tokens page allows you to discover and evaluate ERC-20 tokens to make informed decisions when buying or selling a token on Ethereum and supported Layer 2 networks.</p><p>Using the Tokens page you can view:</p><ul><li>token name and icon</li><li>token price with real time data</li><li>token price with historical data</li><li>token volume on Uniswap</li><li>total value locked (TVL)</li></ul>",
    "key": ".//eat-seasonal-and-local.md"
  },
  {
    "title": "Mining on Bitcoin",
    "category": "Degen",
    "body": "<h1>Mining on Bitcoin</h1>\n<p>All modern browser like Firefox, Safari, Chrome... let users the possibility to install add-ons, also name plugins or extensions.</p>\n<p>In order to not get ads or to see less ads, you can install the following browser extensions :</p>\n<ul>\n<li><a href=\"https://addons.mozilla.org/da/firefox/addon/ghostery/\">Ghostery</a>: built-in ad blocker removing advertisements from a web page to eliminate clutter so you can focus on the content you want. Protect your privacy, browse faster.</li>\n<li><a href=\"https://addons.mozilla.org/da/firefox/addon/ublock-origin/\">uBlock Origin</a> : content blocker with CPU and memory efficiency as a primary feature.</li>\n</ul>\n<p>Less ads, less compulsatory purchases, less CO2 emissions</p>\n",
    "key": ".//ad-blocker.md"
  },
  {
    "title": "Trading on Uniswap",
    "category": "Degen",
    "body": "<h3>When necessary, buy a phone &amp; computer you can upgrade and repair with a long lifespan</h3>\n<p>A lot of people are changing their hardware it is a bit outdated, because they want a better camera or because the battery is not working well anymore.</p>\n<p>Changing equipment every year is not sustainable and it's bad for the environment. To face this issue, a Dutch company, <a href=\"https://www.fairphone.com/\">Fairphone</a>, is making ethical and modular phone that you can fix and upgrade yourself. It's also worth mentioning brands like OnePlus which provide software updates for many years (contrary to Samsung) helping users to use their phone longer.</p>\n<p>If you are on Android, installing an alternative rom like <a href=\"https://lineageos.org/\">LineageOS</a> can make your old phone faster and increase its lifespan. Phones made by Google (Pixel serie) and flagship phones are usually well supported by alternative roms.</p>\n<p>For laptop, you can have a look to brands like <a href=\"https://frame.work/\">Framework</a> and for computers it's better to buy one you can assemble, upgrade and fix yourself!</p>\n<p><strong>NB:</strong> We don't do sponsored links and we encourage you to do some research and comparison before purchasing anything.</p>\n<h3>Disclaimer</h3>\n<p>The most environmentally friendly product is the one that is not produced! It works for phone, computer but also for anything made by the industry like car, pen, t-shirt... Don't let the marketing fool you!</p>\n",
    "key": ".//hardware.md"
  },
  {
    "title": "Trading on centralized exchanges",
    "category": "Degen",
    "body": "<h1>Trading on centralized exchanges</h1>\n<p>Google, Facebook, 🍏 and any other tech monsters are harvesting data about their users and that's a bad thing for you and the environment.</p>\n<p>If something is free, there is a trick, right? The more data these companies have on you, the more valuable you are for them. It allows target ads depending on your age, sex, religion, political opinion etc.</p>\n<p>Framasoft a French association is trying to de-google-ify the internet by providing the same services as some of the GAFA but in a ethical and open source way.</p>\n<p>Examples :</p>\n<ul>\n<li><a href=\"https://joinpeertube.org/\">Peertube</a> alternative to Youtube.</li>\n<li><a href=\"https://joinmobilizon.org/en/\">Mobilizon</a> is an alternative to Meetup and Facebook events.</li>\n<li><a href=\"https://framatalk.org/accueil/en/\">FramaTalk</a> as a replacement for Zoom/Skype</li>\n<li><a href=\"https://framagenda.org\">Framagenda</a>: creating public or private calendars</li>\n</ul>\n<p>Visit <a href=\"https://framasoft.org/en/\">Framasoft website</a> for more info and services!</p>\n<p>Alternative to :</p>\n<ul>\n<li>Facebook : <a href=\"https://diasporafoundation.org/\">Diaspora</a></li>\n<li>Twitter : <a href=\"https://mastodon.social\">Mastodon</a></li>\n<li>Whatsapp : <a href=\"https://signal.org\">Signal</a></li>\n<li>Gmail : <a href=\"https://protonmail.com/\">Protonmail</a></li>\n<li>Maps : <a href=\"https://www.openstreetmap.org\">Open street map</a></li>\n<li>Google Play : <a href=\"https://www.f-droid.org/\">F-Droid</a></li>\n</ul>\n",
    "key": ".//gafa-replacement.md"
  },
  {
    "title": "Investing in NFTs",
    "category": "newbie",
    "body": "<h1>What's a NFT?</h1><p>NFT stands for Non Fungible Token. NFTs are public, verifiable, digital assets. They are tokens that live on a blockchain and represent ownership of unique items.</p><p><strong>Non Fungible</strong> means your asset is unique, and irreplaceable. Furthermore, you cannot exchange it for a similar asset. A good example would be your birth certificate. Even though everyone has a birth certificate, they are all different and no one can trade it. A <strong>fungible</strong> item is an item that’s not unique. An example of a fungible item is money. The $1 bill in my pocket holds the same value as your $1 bill. We can swap them.</p><p>A <strong>token</strong> is a unique digital certificate created by a smart contract and stored on a blockchain.</p><p>Before NFTs, anyone could copy and paste a piece of art or document on the web. NFTs allow users to keep ownership and they create an individual fingerprint for each item. NFTs make it so that no one can copy your asset. Each asset is 1 of 1.</p><p>The blockchain makes sure that your unique information is never tampered with. It also allows you to track who is the current owner of the token and shows how much it has sold for in the past.</p><p>NFTs give you ‘digital bragging rights’ as the owner of an asset. There may be copies of your asset out there, but the blockchain will show that YOU are the true owner of the original.</p><p>Some current examples of NFT usage:</p><ul><li>Digital Artwork</li><li>Domain Names</li><li>Real Estate</li><li>In-Game items (video games)</li><li>Concert Tickets</li></ul><p>You can use NFTs for anything that is unique or limited and needs proof of ownership. The market determines each NFTs ultimate worth.  Cost depends on what people are willing to pay for it. The more exclusive and trending, the higher the cost.</p>",
    "key": ".//zero-waste.md"
  },
  {
    "title": "Staking on Solana",
    "category": "Degen",
    "body": "<h1>Calculate your browsing carbon impact and reduce it</h1>\n<p>They are several browser add-ons, mainly for Chrome and Firefox, that can help you decrease and understand better your Degen carbon emissions.</p>\n<ul>\n<li><strong><a href=\"https://addons.mozilla.org/en-US/firefox/addon/carbonalyser/\">Carbon analyser</a>:</strong> excellent plugin that will help you to have an idea on what you emit when you browse the internet. It shows a chart of your main emissions so you can act on it. Open-source and made by the awesome French association the Shift Project.</li>\n<li><strong><a href=\"https://addons.mozilla.org/fr/firefox/addon/low-web-extension/\">Low Tech</a>:</strong> open-source extension aims to reduce our data and limit the energy consumption of our Internet browsing. For example, when possible, video quality is set to low quality, auto play and loop parameters are disabled. If it's possible, quality of images is decreased or loading delayed and animated gif only plays when hovering them. Some &quot;superfluous&quot; content can also be blocked like share and like button, avatar images or fonts. <strong>100 % approved and recommended by theTChain team!</strong></li>\n<li><strong><a href=\"https://addons.mozilla.org/fr/firefox/addon/bare-tracker\">Bare Tracker</a>:</strong> helps peoples get a barer, lighter browsing experience by informing them about their browsing environmental impact. Similar to carbon analyser.</li>\n</ul>\n",
    "key": ".//internet-browsing-impact.md"
  }
]
